RT-Thread/rt-thread/bsp/nrf52840/nRF5_SDK_15.3.0_59ac3456/components/libraries/util/app_util.h
/**
 * Copyright (c) 2012 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
/** @file
 *
 * @defgroup app_util Utility Functions and Definitions
 * @{
 * @ingroup app_common
 *
 * @brief Various types and definitions available to all applications.
 */

#ifndef APP_UTIL_H__
#define APP_UTIL_H__

#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include "compiler_abstraction.h"
#include "nordic_common.h"
#include "nrf.h"

#ifdef __cplusplus
extern "C" {
#endif
/**
 * @cond (NODOX)
 */
/*lint -save -e27 -e10 -e19 */
#if defined (__LINT__)
#define STACK_BASE 0x1F000 // Arbitrary value.
#define STACK_TOP  0x20000 // Arbitrary value.

#elif defined ( __CC_ARM )
extern char STACK$$Base;
extern char STACK$$Length;
#define STACK_BASE    &STACK$$Base
#define STACK_TOP    ((void*)((uint32_t)STACK_BASE + (uint32_t)&STACK$$Length))

#elif defined ( __ICCARM__ )
extern char CSTACK$$Base;
extern char CSTACK$$Length;
#define STACK_BASE    &CSTACK$$Base
#define STACK_TOP    ((void*)((uint32_t)STACK_BASE + (uint32_t)&CSTACK$$Length))

#elif defined   ( __GNUC__ )
extern uint32_t __StackTop;
extern uint32_t __StackLimit;
#define STACK_BASE    &__StackLimit
#define STACK_TOP     &__StackTop
#endif

/* These macros are valid only when absolute placement is used for the application
 * image. The macros are not compile time symbols. They cannot be used as a
 * constant expression, for example, inside a static assert or linker script
 * at-placement. */
#if defined (__LINT__)
#define CODE_START (0)      // Arbitrary value.
#define CODE_END   (0x1000) // Arbitrary value.
#define CODE_SIZE  (0x1000) // Arbitrary value.

#elif defined ( __CC_ARM )
extern char Load$$LR$$LR_IROM1$$Base;
extern char Load$$LR$$LR_IROM1$$Length;
extern char Load$$LR$$LR_IROM1$$Limit;
#define CODE_START ((uint32_t)&Load$$LR$$LR_IROM1$$Base)
#define CODE_END   ((uint32_t)&Load$$LR$$LR_IROM1$$Limit)
#define CODE_SIZE  ((uint32_t)&Load$$LR$$LR_IROM1$$Length)

#elif defined ( __ICCARM__ )
extern void * __vector_table;
extern char RO_END$$Base;
#define CODE_START ((uint32_t)&__vector_table)
#define CODE_END   ((uint32_t)&RO_END$$Base)
#define CODE_SIZE  (CODE_END - CODE_START)

#elif defined(__SES_ARM)
extern uint32_t * _vectors;
extern uint32_t __FLASH_segment_used_end__;
#define CODE_START ((uint32_t)&_vectors)
#define CODE_END   ((uint32_t)&__FLASH_segment_used_end__)
#define CODE_SIZE  (CODE_END - CODE_START)

#elif defined ( __GNUC__ )
extern uint32_t __isr_vector;
extern uint32_t __etext;
#define CODE_START ((uint32_t)&__isr_vector)
#define CODE_END   ((uint32_t)&__etext)
#define CODE_SIZE  (CODE_END - CODE_START)
#endif
/** @}
 * @endcond
 */
/* lint -restore */

#if defined(MBR_PRESENT) || defined(SOFTDEVICE_PRESENT)
#include "nrf_mbr.h"
#define BOOTLOADER_ADDRESS      ((*(uint32_t *)MBR_BOOTLOADER_ADDR) == 0xFFFFFFFF ? *MBR_UICR_BOOTLOADER_ADDR : *(uint32_t *)MBR_BOOTLOADER_ADDR) /**< The currently configured start address of the bootloader. If 0xFFFFFFFF, no bootloader start address is configured. */
#define MBR_PARAMS_PAGE_ADDRESS ((*(uint32_t *)MBR_PARAM_PAGE_ADDR) == 0xFFFFFFFF ? *MBR_UICR_PARAM_PAGE_ADDR : *(uint32_t *)MBR_PARAM_PAGE_ADDR) /**< The currently configured address of the MBR params page. If 0xFFFFFFFF, no MBR params page address is configured. */
#else
#define BOOTLOADER_ADDRESS      (NRF_UICR->NRFFW[0]) /**< Check UICR, just in case. */
#define MBR_PARAMS_PAGE_ADDRESS (NRF_UICR->NRFFW[1]) /**< Check UICR, just in case. */
#endif

enum
{
    UNIT_0_625_MS = 625,        /**< Number of microseconds in 0.625 milliseconds. */
    UNIT_1_25_MS  = 1250,       /**< Number of microseconds in 1.25 milliseconds. */
    UNIT_10_MS    = 10000       /**< Number of microseconds in 10 milliseconds. */
};

/**
 * @brief Counts number of bits required for the given value
 *
 * The macro technically searches for the highest bit set.
 * For value 0 it returns 0.
 *
 * @param val Value to be processed
 *
 * @return Number of bits required for the given value
 */
//lint -emacro(572,VBITS)
#define VBITS(val) VBITS_32(val)

/**
 * @def VBITS_1
 * @brief Internal macro used by @ref VBITS */
/**
 * @def VBITS_2
 * @brief Internal macro used by @ref VBITS */
/**
 * @def VBITS_4
 * @brief Internal macro used by @ref VBITS */
/**
 * @def VBITS_8
 * @brief Internal macro used by @ref VBITS */
/**
 * @def VBITS_16
 * @brief Internal macro used by @ref VBITS */
/**
 * @def VBITS_32
 * @brief Internal macro used by @ref VBITS */
#define VBITS_1( v) ((((v) & (0x0001U <<  0)) != 0) ? 1U : 0U)
#define VBITS_2( v) ((((v) & (0x0001U <<  1)) != 0) ? VBITS_1 ((v) >>  1) +  1 : VBITS_1 (v))
#define VBITS_4( v) ((((v) & (0x0003U <<  2)) != 0) ? VBITS_2 ((v) >>  2) +  2 : VBITS_2 (v))
#define VBITS_8( v) ((((v) & (0x000fU <<  4)) != 0) ? VBITS_4 ((v) >>  4) +  4 : VBITS_4 (v))
#define VBITS_16(v) ((((v) & (0x00ffU <<  8)) != 0) ? VBITS_8 ((v) >>  8) +  8 : VBITS_8 (v))
#define VBITS_32(v) ((((v) & (0xffffU << 16)) != 0) ? VBITS_16((v) >> 16) + 16 : VBITS_16(v))


